

// ================================================תרגיל animation===============================================

// 1.	הוסיפו כפתור שמזיז את האלמנט הקטן חזרה שמאלה.
// var move = 0;
// bi.onclick = () => {
//     window.setInterval(() => {
//         po.style.left = `${move}px`
//         move=move+50
//     }, 5000)
// }

// backToStart.onclick = () => {
//     move=0
//     po.style.left = `${move}px`

// }
// ============================================2============================================

// 2.	צרו מערך של תמונות.

// var images = document.getElementById("images")

// var arrayimg = [
//     "https://cdn.pixabay.com/photo/2017/07/07/04/09/girl-2480361__340.jpg",
//     "https://cdn.pixabay.com/photo/2017/08/06/09/52/black-and-white-2590810__340.jpg",
//     "https://cdn.pixabay.com/photo/2016/02/11/19/14/couple-1194312__340.jpg",
//     "https://cdn.pixabay.com/photo/2018/01/24/19/49/people-3104635__480.jpg",
//     " https://cdn.pixabay.com/photo/2015/11/07/11/01/couple-1030744__480.jpg"
// ]

// ============================================3============================================
// 3.	צרו סליידר שהתמונות בו מתחלפות כל 2 שניות בצורה אוטומטית.

// let index = 0;
// imeg.src = arrayimg[0]
// function img() {
//     imeg.src = arrayimg[index];
//     imeg.src = arrayimg[index++]

//     if (index == arrayimg.length) {
//         index = 0;
//     }
// }
// var x = window.setInterval(() => { img() }, 2000)


// ============================================4============================================

// 4.	צרו כפתור "next" שמביא את התמונה הבאה וכפתור "previous" לתמונה הקודמת.

// var next = document.getElementById("next")
// var bifor = document.getElementById("previous")

// var index=0;

// imeg.src=arrayimg[0]
// next.onclick=function(){
//     imeg.src=arrayimg[index++]
//     if(index>=arrayimg.length){
//         index=0
//     }

// }
// imeg.src=arrayimg[0]
// previous.onclick=function(){
//     imeg.src=arrayimg[index--]
//     if(index<0){
//         index=arrayimg.length-1
//     }
// }

// ============================================5============================================

// 5.	צרו כפתור שמתחיל את המעברים וכפתור שעוצר את המעברים.

// stop.onclick = function () {
//     clearInterval(x)
// }
// start.onclick=()=>{
//     window.setInterval(()=>{img()},2000)
// }

// / ============================================6============================================
// 6.	צרו כפתור שמשנה את סוג האנימציה במעברים.

// var move = 0;
// ani.onclick = () => {
//     window.setInterval(() => {
//         animationpra.style.left = `${move++}px`
//     }, 50)
// }




// ============================================7============================================
// 7.	צרו כפתור שמערבב את סדר התמונות.

// ============================================8============================================
// 8.	צרו מנגנון שמאפשר למשתמש לבחור איזה תמונה לראות.

// ============================================9============================================

// 9.	צרו כותרת שנעה מעל התמונות הלוך ושוב משמאל לימין.
// ============================================10============================================

// 10.	רחיפה מעל הכותרת עוצרת אותה וצובעת בצבע אחר.

// ============================================11============================================

// 11.	הוסיפו מנגנון שבעת רחיפה על תמונה, האנימציה עוצרת והתמונה גדלה.


